Tekla Open API Reference for Tekla Structures 2025
UserPropertyOption.OptionLabelTranslated Property
 The translated option name.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string OptionLabelTranslated { get; set; }
Public Property OptionLabelTranslated As String
	Get
	Set
Property Value
Type: String
See Also
Reference
UserPropertyOption Class
Tekla.Structures.Catalogs Namespace